Revit 2027 API
ParameterTypeId.FabricParamTotalSheetMass Property
 "Total Sheet Mass": Calculated all sheet mass: Volume of Wire * Unit Weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricParamTotalSheetMass { get; }
Public Shared ReadOnly Property FabricParamTotalSheetMass As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricParamTotalSheetMass {
	ForgeTypeId^ get ();
}
static member FabricParamTotalSheetMass : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace